# Exercicios

In [1]:
import pandas as pd

In [2]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [3]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [4]:
aprovados = alunos['Aprovado'] == True

In [5]:
aprovados

0     True
1    False
2    False
3     True
4     True
5     True
6    False
7    False
Name: Aprovado, dtype: bool

In [16]:
#Crie um DataFrame somente com os alunos aprovados.
a1 = (alunos['Aprovado'] == True)

In [14]:
aprovados = alunos[a1]

In [15]:
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [20]:
# Crie um DataFrame somente com as alunas aprovadas.
a2 = ((alunos['Aprovado'] == True) & (alunos['Sexo']=='F'))
alunas_aprovadas = alunos[a2]
alunas_aprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [23]:
#Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.
a3 = ((alunos['Idade']) >= 10) & (alunos['Idade'] <=20) | (alunos['Idade']>=40)
idade = alunos[a3]
idade

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False